Revit 2024 API
RebarContainerItem.MaxSpacing Property
 Identifies the maximum spacing between rebar in rebar set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public double MaxSpacing { get; set; }
Visual Basic
Public Property MaxSpacing As Double
	Get
	Set
Visual C++
public:
property double MaxSpacing {
	double get ();
	void set (double value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The maxSpacing isn't bigger than 0.0.
Autodesk.Revit.Exceptions.InapplicableDataException |  This rebar element represents a single bar (the layout rule is Single).
See Also
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace